# SQLite 
ML Developer stack(4)

In [1]:
import sqlite3

In [3]:
#establishing connection between database and python
db=sqlite3.connect("SQLitedatabse1.db")
db

In [4]:
#the sqlite3.connect function creates a database if it does not aldready exist.
db=sqlite3.connect("student_database.db")
db

In [5]:
#creating a cursor object
cur=db.cursor()

In [7]:
sql_quer="create table student_details(roll_no int primary key, name text, age int default 12)"
cur.execute(sql_quer)

In [8]:
#to specify a string inside another string use doube quotes for the inner string
sql_query='insert into student_details values(101, "aman", 20)'
cur.execute(sql_query)
#commit() method is used to push any pending changes to the database 
db.commit()

In [30]:
roll=110
name1='pz'
age=19

sql_query='insert into student_details values(%d,"%s",%d)'%(roll, name1, age)
#sql_query='insert into student_details values(102,"pz",19)'
print(sql_query)
cur.execute(sql_query)
db.commit()

insert into student_details values(110,"pz",19)

In [18]:
roll=103
name1='vz'
age=15
sql_query='insert into student_details values({},"{}", {})'.format(roll, name1, age)
cur.execute(sql_query)
db.commit()

In [27]:
roll=105
name1='rz'
age=46
cur.execute('insert into student_details values(?,?,?)', (roll, name1, age))
db.commit()

In [31]:
values=[(roll+2, 'kds', age-20),(roll+3, 'kdsdjknfd', age-22), (roll+4, 'kdsdcdkj', age-24)]
cur.executemany('insert into student_details values(?,?,?)', values)
db.commit()

In [32]:
ql_query='select * from student_details'
cur.execute(ql_query)
for i in cur:
    print(i)

(101, 'aman', 20)
(102, 'pz', 19)
(103, 'vz', 15)
(104, 'dz', 46)
(105, 'rz', 46)
(110, 'pz', 19)
(112, 'kds', -1)
(113, 'kdsdjknfd', -3)
(114, 'kdsdcdkj', -5)

In [35]:
cur.execute(ql_query)
print(cur.fetchone())

(101, 'aman', 20)

In [36]:
print(cur.fetchmany(3))

[(102, 'pz', 19), (103, 'vz', 15), (104, 'dz', 46)]

In [37]:
print(cur.fetchall())

[(105, 'rz', 46), (110, 'pz', 19), (112, 'kds', -1), (113, 'kdsdjknfd', -3), (114, 'kdsdcdkj', -5)]

In [39]:
#converting SQL table to a pandas dataframe
import pandas as pd

In [42]:
#data_frame object has all the data loaded by the query stored in it
data_frame = pd.read_sql_query("select * from student_details", db)
data_frame

   roll_no       name  age
0      101       aman   20
1      102         pz   19
2      103         vz   15
3      104         dz   46
4      105         rz   46
5      110         pz   19
6      112        kds   -1
7      113  kdsdjknfd   -3
8      114   kdsdcdkj   -5

In [44]:
data_frame['adress']='test'
data_frame

   roll_no       name  age adress
0      101       aman   20   test
1      102         pz   19   test
2      103         vz   15   test
3      104         dz   46   test
4      105         rz   46   test
5      110         pz   19   test
6      112        kds   -1   test
7      113  kdsdjknfd   -3   test
8      114   kdsdcdkj   -5   test

In [45]:
#converting a pamdas data_fram to a SQL table
data_frame.to_sql('student_details',db, if_exists='replace')

9